tutorials/incompressible/icoFoam/elbow/0/p
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    wall-4          
    {
        type            zeroGradient;
    }

    velocity-inlet-5 
    {
        type            zeroGradient;
    }

    velocity-inlet-6 
    {
        type            zeroGradient;
    }

    pressure-outlet-7 
    {
        type            fixedValue;
        value           uniform 0;
    }

    wall-8          
    {
        type            zeroGradient;
    }

    frontAndBackPlanes 
    {
        type            empty;
    }
}

// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
